danielgusvt/M1s_BL808_SDK/components/platform/hosal/bl808_hal/bl_cam.c
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifdef CONF_USER_YUV_CAM
#include <string.h>
#include <stdio.h>

#include <bl_dsp2.h>
#include <mm_dsp2.h>
#include <bl808_dsp2_misc.h>
#include <bl808_cam.h>
#include <bl808_clkrst.h>

#include <bl808_glb.h>
#include <bl808_csi.h>
#include <bl808_dvp_tsrc.h>
#include <bl808_mjpeg.h>
#include <jpeg_head.h>
#include <sensor.h>

#include "bl_cam.h"
#define img_width               640
#define img_height              480
#define mjpeg_width             480
#define mjpeg_height            320
#define img_num                 2
#define fifo_th_gc0308          600
#define CAM_USE_ID              CAM6_ID
#define MJPEG_CAM_ID            CAM4_ID
#define RGB888_SIZE_PER_PIX     3
#define RGB0_SIZE_PER_PIX       4
#define mjpeg_buf_size          1 * 1024 * 1024
#define MJPEG_QUALITY           75
#define JPEG_HEADER             0x30021800
#define VRAM_ADDR               0x3F000000

static uint8_t *pic_buf = NULL;
static uint8_t *line_buf = NULL;
static uint8_t *mjpeg_buf = NULL;
static int dvp2x_enable_flag = 0;

static int bl_dvp2x_init(void)
{
    DVP_2x_Cfg_Type dvpCfg =
    {
        .hSyncLevel = DSP2_MISC_ACTIVE_HIGH,
        .vSyncLevel = DSP2_MISC_ACTIVE_HIGH,
        .dataOrder = DSP2_MISC_2X_DATA_BYTE_LOWER,
        .fifoThreshold = fifo_th_gc0308,
    };

    if (dvp2x_enable_flag == 0) {
        DSP2_Clk_Sel(DSP2_CLK_160MHz, ENABLE, 1);
        MM_YUVSensor_Init();

        DSP2_MSIC_DVP_2x_Init(&dvpCfg);
        DSP2_MSIC_DVP_2x_Enable();
        dvp2x_enable_flag = 1;
        printf("dvp2x init\r\n");
    }
    return 0;
}

int bl_cam_yuv_init(void)
{
    int ret = 0;

    CAM_CFG_Type cameraCfg =
    {
        .swMode = CAM_SW_MODE_MANUAL,
        .swIntCnt = 0,
        .pixWidth = CAM_PIX_DATA_BIT_24TO32,
        .dropMode = CAM_DROP_NONE,
        .linePol = CAM_LINE_ACTIVE_POLARITY_HIGH,
        .framePol = CAM_FRAME_ACTIVE_POLARITY_HIGH,
        .camSensorMode = CAM_SENSOR_MODE_V_AND_H,
        .burstType = CAM_BURST_TYPE_INCR64,
        .waitCount = 0x40,
        .frameSize = img_width * img_height * RGB0_SIZE_PER_PIX, //RGB0 one pixcel 3 bytes
    };
    if (pic_buf == NULL) {
        pic_buf = pvPortMalloc(img_width * img_height * RGB0_SIZE_PER_PIX * img_num);
        if (pic_buf == NULL) {
            printf("malloc pic buf fail\r\n");
            ret = -1;
            goto exit;
        }
    }

    bl_dsp2_scaler_path_dvp2x(DSP2_MISC_SCALER_D);
    /* Setting 8bit BT.601 YUV to RGB */
    DSP2_YUV2RGB_Init(DSP2_YUV2RGB_PARAM_8BIT_BT601);
    DSP2_YUV2RGB_Set_Input(DSP2_YUV2RGB_A, DSP2_YUV2RGB_INPUT_SCALER_D);
    DSP2_MISC_CAM_Input_Select(DSP2_MISC_CAM_6_ID, DSP2_MISC_CAM_YUV2RGB_OUTPUT);
 
    cameraCfg.memStart = (uint32_t)(uintptr_t)pic_buf;
    cameraCfg.memSize = img_width * img_height * RGB0_SIZE_PER_PIX * img_num;
 
    CAM_Init(CAM_USE_ID, &cameraCfg);
    CAM_Enable(CAM_USE_ID);
    bl_dvp2x_init();
exit:
    return ret;
}

void bl_cam_yuv_cb_register(cam_callback_type *cb)
{
    CAM_Int_Callback_Install(CAM_USE_ID, CAM_INT_NORMAL, cb);
    CAM_IntMask(CAM_USE_ID, CAM_INT_NORMAL, UNMASK);
    CAM_IntMask(CAM_USE_ID, CAM_INT_MEMORY_OVERWRITE, UNMASK);
    CAM_IntMask(CAM_USE_ID, CAM_INT_FRAME_OVERWRITE, UNMASK);
    CAM_IntMask(CAM_USE_ID, CAM_INT_FIFO_OVERWRITE, UNMASK);

    CPU_Interrupt_Enable(DVP2AXI_G_IRQn);
}

void bl_cam_yuv_deinit(void)
{
    CAM_Disable(CAM_USE_ID);
    vPortFree(pic_buf);
    pic_buf = NULL;
}

int bl_cam_rgb_frame_get(uint8_t **pic, uint32_t *len)
{
    int ret = 0;
    CAM_Frame_Info info;
    memset(&info, 0, sizeof(info));

    CAM_Get_Frame_Info(CAM_USE_ID, &info);

    if (info.validFrames == 0) {
        ret = -1;
        goto exit;
    }

    *pic = (uint8_t *)(uintptr_t)(info.curFrameAddr);
    *len = info.curFrameBytes;
exit:
    return ret;
}

void bl_cam_yuv_frame_pop(void)
{
    CAM_Pop_Frame(CAM_USE_ID);
}

static uint16_t Q_Table_50_Y[64] = {
    16,  11,  10,  16,  24,  40,  51,  61,
    12,  12,  14,  19,  26,  58,  60,  55,
    14,  13,  16,  24,  40,  57,  69,  56,
    14,  17,  22,  29,  51,  87,  80,  62,
    18,  22,  37,  56,  68, 109, 103,  77,
    24,  35,  55,  64,  81, 104, 113,  92,
    49,  64,  78,  87, 103, 121, 120, 101,
    72,  92,  95,  98, 112, 100, 103,  99,
};

static uint16_t Q_Table_50_UV[64] = {
    17,  18,  24,  47,  99,  99,  99,  99,
    18,  21,  26,  66,  99,  99,  99,  99,
    24,  26,  56,  99,  99,  99,  99,  99,
    47,  66,  99,  99,  99,  99,  99,  99,
    99,  99,  99,  99,  99,  99,  99,  99,
    99,  99,  99,  99,  99,  99,  99,  99,
    99,  99,  99,  99,  99,  99,  99,  99,
    99,  99,  99,  99,  99,  99,  99,  99,
};

static uint8_t jpgHeadBuf[768];

int bl_cam_mjpeg_init(void)
{
    int ret = 0;
    uint16_t tmpTableY[64] = {0};
    uint16_t tmpTableUV[64] = {0};
    uint32_t jpgHeadLength;

