danielgusvt/M1s_BL808_SDK/components/platform/hosal/bl808_hal/bl_cam.c
    CAM_CFG_Type cameraCfg =
    {
        .swMode = CAM_SW_MODE_AUTO,
        .swIntCnt = 0,
        .pixWidth = CAM_PIX_DATA_BIT_16,
        .dropMode = CAM_DROP_NONE,
        .linePol = CAM_LINE_ACTIVE_POLARITY_HIGH,
        .framePol = CAM_FRAME_ACTIVE_POLARITY_HIGH,
        .camSensorMode = CAM_SENSOR_MODE_V_AND_H,
        .burstType = CAM_BURST_TYPE_INCR16,
        .waitCount = 0x40,
        .memStart = NULL,
        .memSize = mjpeg_width * 8 * 2 * 2,
        .frameSize = mjpeg_width * mjpeg_height * 2,
    };

    MJPEG_CFG_Type mjpegCfg = 
    {
        .burst = MJPEG_BURST_INCR16,
        .yuv = MJPEG_YUV422_INTERLEAVE,
        .frameCount = 0,
        .waitCount = 0x100,
        .bufferMjpeg = NULL,
        .sizeMjpeg = mjpeg_buf_size,
        .bufferCamYY = NULL,
        .sizeCamYY = 2,
        .bufferCamUV = 0,
        .sizeCamUV = 0,
        .resolutionX = mjpeg_width,
        .resolutionY = mjpeg_height,
        .bitOrderEnable = ENABLE,
        .evenOrderEnable = ENABLE,
        .swapModeEnable = DISABLE,
        .readStartEnable = ENABLE,
        .reflectDmy = DISABLE,
        .verticalDmy = DISABLE,
        .horizationalDmy = DISABLE,
    };

    DSP2_MISC_Scaler_Cfg_Type scaler_cfg = 
    {
        .inputWidth = img_width,
        .inputHeight = img_height,
        .outputWidth = mjpeg_width,
        .outputHeight = mjpeg_height,
    };

    if (line_buf == NULL) {
        line_buf = pvPortMalloc(mjpeg_width * 8 * 2 * 2);
        if (line_buf == NULL) {
            ret = -1;
            goto exit;
        }
    }

    if (mjpeg_buf == NULL) {
        mjpeg_buf = pvPortMalloc(mjpeg_buf_size);
        if (mjpeg_buf == NULL) {
            vPortFree(line_buf);
            line_buf = NULL;
            ret = -1;
            goto exit;
        }
    }
    cameraCfg.memStart = (uint32_t)(uintptr_t)line_buf;
    mjpegCfg.bufferCamYY = (uint32_t)(uintptr_t)line_buf;
    mjpegCfg.bufferMjpeg = (uint32_t)(uintptr_t)mjpeg_buf;

    MJPEG_Set_YUYV_Order_Interleave(0,1,2,3);
 
    MJPEG_Calculate_Quantize_Table(Q_Table_50_Y,tmpTableY,MJPEG_QUALITY);
    MJPEG_Calculate_Quantize_Table(Q_Table_50_UV,tmpTableUV,MJPEG_QUALITY);
    MJPEG_Set_Quantize_Table_Y(tmpTableY);
    MJPEG_Set_Quantize_Table_UV(tmpTableUV);
    MJPEG_Quantize_SRAM_Switch();
 
    jpgHeadLength = JpegHeadCreate(YUV_MODE_422, MJPEG_QUALITY, mjpeg_width, mjpeg_height, jpgHeadBuf);
    memcpy((uint8_t *)JPEG_HEADER, jpgHeadBuf, jpgHeadLength); //cpy jpeg header to refernce sram 0x30021800
    csi_dcache_clean_range((void *)JPEG_HEADER, jpgHeadLength);
    MJPEG_Frame_Head_Set_Size(jpgHeadLength);
    MJPEG_Frame_Tail_Auto_Fill(ENABLE);
    /* enable scaler for 480x320*/ 
    DSP2_MISC_Scaler_Input_Select(DSP2_MISC_SCALER_2_ID, DSP2_MISC_SCALER_DVP_2X_OUTPUT);
    DSP2_MISC_Scaler_Init(DSP2_MISC_SCALER_2_ID, &scaler_cfg);
    DSP2_MISC_Scaler_Enable(DSP2_MISC_SCALER_2_ID);
 
    DSP2_MISC_CAM_Input_Select(MJPEG_CAM_ID, DSP2_MISC_CAM_SCALER_2_OUTPUT);
    CAM_Init(MJPEG_CAM_ID, &cameraCfg);
    MJPEG_Init(&mjpegCfg);
    MJPEG_Set_Planar_Y_UV_Input(4, 5);
    MJPEG_Enable();

    CAM_Enable(MJPEG_CAM_ID);
    bl_dvp2x_init();
exit:
    return ret;
}

int bl_cam_mjpeg_get(uint8_t **ptr, uint32_t *len)
{
    int ret = 0;
    MJPEG_Frame_Info mjpeg_info;
    MJPEG_Get_Frame_Info(&mjpeg_info);

    if (mjpeg_info.validFrames > 0) {
        if ((mjpeg_info.curFrameAddr + mjpeg_info.curFrameBytes) < ((uint32_t)(uintptr_t)mjpeg_buf + mjpeg_buf_size)) {
            *ptr = (uint8_t *)(uintptr_t)mjpeg_info.curFrameAddr;
            *len = mjpeg_info.curFrameBytes;
        } else {
            bl_cam_mjpeg_pop();
            ret = -1;
        }
    } else {
        ret = -1;
    }
    return ret;
}

int bl_cam_mjpeg_pop(void)
{
    MJPEG_Pop_Frame();
    return 0;
}

int bl_cam_mjpeg_deinit(void)
{
    MJPEG_Disable();
    CAM_Disable(MJPEG_CAM_ID);

    if (line_buf != NULL) {
        vPortFree(line_buf);
        line_buf = NULL;
    }

    if (mjpeg_buf != NULL) {
        vPortFree(mjpeg_buf);
        mjpeg_buf = NULL;
    }

    return 0;
}
#endif

#define MIPI_CAM_USE_ID                     CAM7_ID
#define RGB565_CAM_USE_ID                   CAM5_ID

#define MIPI_WIDTH                     1600
#define MIPI_HEIGHT                    1200
#define SCALER_WIDTH                   800
#define SCALER_HEIGHT                  600
#define RGB565_SCALER_WIDTH            400
#define RGB565_SCALER_HEIGHT           300
#define RGB0_SCALER_WIDTH              400
#define RGB0_SCALER_HEIGHT             300
#define YUV422_FRAME_SIZE              (MIPI_WIDTH * MIPI_HEIGHT * 2)
#define RGB0_FRAME_SIZE                (RGB0_SCALER_WIDTH * RGB0_SCALER_HEIGHT * 4)
#define RGB565_FRAME_SIZE              (RGB565_SCALER_WIDTH * RGB565_SCALER_HEIGHT * 2)
#define FRAME_COUNT                    2 

#define DSP2_USE_CLK                    (80000000)
#define PIX_USE_CLK                    (66000000)

#define SENSOR_REF_CLK_MHZ             24
#define SENSOR_HS_CLK_MHZ              520

static uint8_t *mipi_pic_buf = NULL;
static uint8_t *rgb565_pic_buf = NULL;
static int mipi_csi_enable_flag = 0;

static CSI_CFG_Type csiCfg = 
{
    .dvp0VirtualChan = 0,
    .laneNum = CSI_LANE_NUMBER_2,
    .dataUnpackEn = ENABLE,
    .syncShortPacketEn = ENABLE,
    .dataBitInverseEn = DISABLE,
    .laneInverseEn = DISABLE,
};

static int bl_yuv2rgb_init(void)
{
    DSP2_YUV2RGB_Init(DSP2_YUV2RGB_PARAM_8BIT_BT601);
    DSP2_YUV2RGB_Set_Input(DSP2_YUV2RGB_A, DSP2_YUV2RGB_INPUT_DSP2_INPUT);
    return 0;
}

static int bl_cam_mipi_csi_init(void)
{
    uint32_t fifoThreshold = 0;
    HBN_AON_PAD_CFG_Type aonPadCfg = {
        DISABLE,
        DISABLE,
        DISABLE,
        HBN_GPIO_PAD_PULL_NONE,
    };

    if (0 == mipi_csi_enable_flag) {
        HBN_Aon_Pad_Cfg(DISABLE, HBN_AON_PAD_GPIO40, &aonPadCfg);
        HBN_Aon_Pad_Cfg(DISABLE, HBN_AON_PAD_GPIO41, &aonPadCfg);
        DVP_TSRC_Disable(DVP_TSRC0_ID);

        GLB_Set_Ldo15cis_Vout(GLB_LDO15CIS_LEVEL_1P20V);
        GLB_CSI_Config_MIPIPLL(2, 0x21000);
        GLB_CSI_Power_Up_MIPIPLL();
        GLB_Set_DSP_DSP2_CLK(ENABLE, GLB_DSP_DSP2_CLK_MUXPLL_160M, 1);
        fifoThreshold = (DSP2_USE_CLK-PIX_USE_CLK)/1000*MIPI_WIDTH/(DSP2_USE_CLK/1000)+10;
        DVP_TSRC_Sensor_Input_Set(DVP_TSRC0_ID,fifoThreshold,DISABLE,DISABLE);

