danielgusvt/M1s_BL808_SDK/components/platform/hosal/bl808_hal/bl_cam.c
        DSP2_MISC_TSRC_Source_Select(DSP2_MISC_TSRC_SOURCE_CSI);
        CSI_Disable(CSI0_ID);
        CSI_PHY_Disable_Lanes(CSI0_ID);
        CSI_PHY_Reset(CSI0_ID);
        CSI_Init_Yuv_Sensor(CSI0_ID, &csiCfg);
        CSI_PHY_Config(CSI0_ID, SENSOR_REF_CLK_MHZ, SENSOR_HS_CLK_MHZ);
        CSI_Enable(CSI0_ID);
        CSI_PHY_Enable_Lanes(CSI0_ID, CSI_LANE_NUMBER_2);
        DVP_TSRC_Enable(DVP_TSRC0_ID);

        bl_yuv2rgb_init();
        /*init sensor */
        mipi_sensor_init();

        mipi_csi_enable_flag = 1;
    }
    return 0;
}

int bl_cam_mipi_yuv_init(void)
{
    int ret = 0;
    CAM_CFG_Type camcfg =
    {
        .swMode = CAM_SW_MODE_MANUAL,
        .swIntCnt = 0,
        .pixWidth = CAM_PIX_DATA_BIT_24TO32,
        .dropMode = CAM_DROP_NONE,
        .linePol = CAM_LINE_ACTIVE_POLARITY_HIGH,
        .framePol = CAM_FRAME_ACTIVE_POLARITY_HIGH,
        .camSensorMode = CAM_SENSOR_MODE_V_AND_H,
        .burstType = CAM_BURST_TYPE_INCR16,
        .waitCount = 0x40,
        .memStart = NULL, //need init 
        .memSize = 0,
        .frameSize = RGB0_FRAME_SIZE,
    };

    if (mipi_pic_buf == NULL) {
        mipi_pic_buf = pvPortMalloc(RGB0_FRAME_SIZE * FRAME_COUNT);
        if (NULL == mipi_pic_buf) {
            printf("malloc mipi pic buf fail\r\n");
            ret = -1;
            goto exit;
        }
    }

    DSP2_MISC_Scaler_Cfg_Type scaler_cfg = 
    {
        .inputWidth = MIPI_WIDTH,
        .inputHeight = MIPI_HEIGHT,
        .outputWidth = RGB0_SCALER_WIDTH,
        .outputHeight = RGB0_SCALER_HEIGHT,
    };

    bl_cam_mipi_csi_init();

    DSP2_MISC_Scaler_Input_Select(DSP2_MISC_SCALER_3_ID, DSP2_MISC_SCALER_DSP2_INPUT);
    DSP2_MISC_Scaler_Init(DSP2_MISC_SCALER_3_ID, &scaler_cfg);
    DSP2_MISC_Scaler_Enable(DSP2_MISC_SCALER_3_ID);

    DSP2_Scaler_Set_Input(DSP2_MISC_SCALER_D, DSP2_MISC_SCALER_DSP2_INPUT);
    DSP2_YUV2RGB_Init(DSP2_YUV2RGB_PARAM_8BIT_BT601);
    DSP2_YUV2RGB_Set_Input(DSP2_YUV2RGB_A, DSP2_YUV2RGB_INPUT_SCALER_D);

    DSP2_MISC_CAM_Input_Select(DSP2_MISC_CAM_7_ID, DSP2_MISC_CAM_YUV2RGB_OUTPUT);
    camcfg.memStart = (uint32_t)(uintptr_t)mipi_pic_buf;
    camcfg.memSize = RGB0_FRAME_SIZE * FRAME_COUNT;
    CAM_Init(MIPI_CAM_USE_ID, &camcfg);
    CAM_Enable(MIPI_CAM_USE_ID);
exit:
    return ret;
}

void bl_cam_mipi_yuv_deinit(void)
{
    CAM_Disable(MIPI_CAM_USE_ID);
    vPortFree(mipi_pic_buf);
    mipi_pic_buf = NULL;
}

int bl_cam_mipi_rgb_frame_get(uint8_t **pic, uint32_t *len)
{
    int ret = 0;
    CAM_Frame_Info info;
    memset(&info, 0, sizeof(info));

    CAM_Get_Frame_Info(MIPI_CAM_USE_ID, &info);

    if (info.validFrames == 0) {
        ret = -1;
        goto exit;
    }

    *pic = (uint8_t *)(uintptr_t)(info.curFrameAddr);
    *len = info.curFrameBytes;
exit:
    return ret;
}

void bl_cam_mipi_frame_pop(void)
{
    CAM_Pop_Frame(MIPI_CAM_USE_ID);
}

int bl_cam_mipi_rgb565_init(void)
{
    int ret = 0;
    CAM_CFG_Type camcfg =
    {
        .swMode = CAM_SW_MODE_MANUAL,
        .swIntCnt = 0,
        .pixWidth = CAM_PIX_DATA_BIT_24TO16,
        .dropMode = CAM_DROP_NONE,
        .linePol = CAM_LINE_ACTIVE_POLARITY_HIGH,
        .framePol = CAM_FRAME_ACTIVE_POLARITY_HIGH,
        .camSensorMode = CAM_SENSOR_MODE_V_AND_H,
        .burstType = CAM_BURST_TYPE_INCR16,
        .waitCount = 0x40,
        .memStart = NULL, //need init 
        .memSize = 0,
        .frameSize = RGB565_FRAME_SIZE,
    };

    if (rgb565_pic_buf == NULL) {
        rgb565_pic_buf = pvPortMalloc(RGB565_FRAME_SIZE * FRAME_COUNT);
        if (NULL == rgb565_pic_buf) {
            printf("malloc rgb565 pic buf fail\r\n");
            ret = -1;
            goto exit;
        }
    }

    DSP2_MISC_Scaler_Cfg_Type scaler_cfg = 
    {
        .inputWidth = MIPI_WIDTH,
        .inputHeight = MIPI_HEIGHT,
        .outputWidth = RGB565_SCALER_WIDTH,
        .outputHeight = RGB565_SCALER_HEIGHT,
    };

    bl_cam_mipi_csi_init();

    DSP2_MISC_Scaler_Input_Select(DSP2_MISC_SCALER_2_ID, DSP2_MISC_SCALER_DSP2_INPUT);
    DSP2_MISC_Scaler_Init(DSP2_MISC_SCALER_2_ID, &scaler_cfg);
    DSP2_MISC_Scaler_Enable(DSP2_MISC_SCALER_2_ID);

    DSP2_Scaler_Set_Input(DSP2_MISC_SCALER_C, DSP2_MISC_SCALER_DSP2_INPUT);
    DSP2_YUV2RGB_Init(DSP2_YUV2RGB_PARAM_8BIT_BT601);
    DSP2_YUV2RGB_Set_Input(DSP2_YUV2RGB_A, DSP2_YUV2RGB_INPUT_SCALER_C);

    DSP2_MISC_CAM_Input_Select(DSP2_MISC_CAM_5_ID, DSP2_MISC_CAM_YUV2RGB_OUTPUT);
    camcfg.memStart = (uint32_t)(uintptr_t)rgb565_pic_buf;
    camcfg.memSize = RGB565_FRAME_SIZE * FRAME_COUNT;
    CAM_Init(RGB565_CAM_USE_ID, &camcfg);
    CAM_16_Bit_RGB_order(RGB565_CAM_USE_ID, CAM_16_BIT_BGR);
    CAM_Enable(RGB565_CAM_USE_ID);
exit:
    return ret;
}

void bl_cam_mipi_rgb565_deinit(void)
{
    CAM_Disable(RGB565_CAM_USE_ID);
    vPortFree(mipi_pic_buf);
    mipi_pic_buf = NULL;
}

int bl_cam_mipi_rgb565_frame_get(uint8_t **pic, uint32_t *len)
{
    int ret = 0;
    CAM_Frame_Info info;
    memset(&info, 0, sizeof(info));

    CAM_Get_Frame_Info(RGB565_CAM_USE_ID, &info);

    if (info.validFrames == 0) {
        ret = -1;
        goto exit;
    }

    *pic = (uint8_t *)(uintptr_t)(info.curFrameAddr);
    *len = info.curFrameBytes;
exit:
    return ret;
}

void bl_cam_mipi_rgb565_frame_pop(void)
{
    CAM_Pop_Frame(RGB565_CAM_USE_ID);
}

int bl_cam_mipi_mjpeg_init(void)
{
    int ret = 0;
    uint16_t tmpTableY[64] = {0};
    uint16_t tmpTableUV[64] = {0};
    uint32_t jpgHeadLength;

    bl_cam_mipi_csi_init();

    CAM_CFG_Type cameraCfg =
    {
        .swMode = CAM_SW_MODE_AUTO,
        .swIntCnt = 0,
        .pixWidth = CAM_PIX_DATA_BIT_16,
        .dropMode = CAM_DROP_NONE,
        .linePol = CAM_LINE_ACTIVE_POLARITY_HIGH,
        .framePol = CAM_FRAME_ACTIVE_POLARITY_HIGH,
        .camSensorMode = CAM_SENSOR_MODE_V_AND_H,
        .burstType = CAM_BURST_TYPE_INCR64,
        .waitCount = 0x40,
        .memStart = NULL,
        .memSize = SCALER_WIDTH * 8 * 2 * 2,
        .frameSize = SCALER_WIDTH * SCALER_HEIGHT * 2,
    };

